
import React from 'react';

const TermsPage: React.FC = () => {
  return (
    <div className="bg-gray-50">
      <section className="bg-brand-green text-white text-center py-12">
        <div className="container mx-auto px-4">
          <h1 className="text-4xl font-bold">شروط الخدمة</h1>
        </div>
      </section>

      <div className="container mx-auto px-4 py-16">
        <div className="max-w-4xl mx-auto bg-white p-8 rounded-lg shadow-md">
          <div className="prose prose-lg text-right max-w-none text-gray-700">
            <p>
              مرحبًا بك في تكت زون! تحكم شروط الخدمة هذه ("الشروط") استخدامك لموقع وخدمات تكت زون ("الخدمات"). يرجى قراءة هذه الشروط بعناية قبل الوصول إلى خدماتنا أو استخدامها.
            </p>
            
            <ol className="list-decimal space-y-4 ps-8">
              <li>قبول الشروط: من خلال الوصول إلى خدماتنا أو استخدامها، فإنك توافق على الالتزام بهذه الشروط. إذا كنت لا توافق على هذه الشروط، فلا يجوز لك استخدام خدماتنا.</li>
              <li>خدماتنا: توفر منصة التذاكر منصة عبر الإنترنت لشراء تذاكر كرة القدم لمباريات الدوري العراقي الممتاز لكرة القدم، من خلال بيع التذاكر من قبل خدماتنا فإنك توافق على الامتثال للشروط والأحكام التي تحددها الدوري والأندية المعنية.</li>
              <li>حساب المستخدم: قد يتطلب استخدام ميزات معينة بخدماتنا، قد تحتاج إلى إنشاء حساب. أنت مسؤول عن الحفاظ على سرية بيانات اعتماد حسابك وعن جميع الأنشطة التي تحدث ضمن حسابك.</li>
              <li>شراء التذاكر: بينما نسعى جاهدين لتوفير معلومات دقيقة وحديثة، فإننا لا نضمن دقة أسعار التذاكر. قد تكون هناك حالات تم فيها بيع التذاكر أو عدم توفرها. تخضع مشتريات التذاكر للشروط والتاكيد.</li>
              <li>الدفع والمبالغ المستردة: يتم تحديد أسعار التذاكر وتفاصيل الدفع بوضوح أثناء عملية الدفع. جميع المشتريات نهائية وغير قابلة للاسترداد، ما لم يتم إلغاء الحالات التي يتم فيها إلغاء المباريات أو إعادة جدولتها، ستتم معالجة المبالغ المستردة، إن وجدت، وفقًا لسياسة الاسترداد الخاصة بنا.</li>
              <li>من القوانين ذات الصلة, قد لا يجوز لك استخدام, أو تكرير استخدام, أو توزيع المحتوى بدون موافقتنا الكتابية المسبقة.</li>
            </ol>
          </div>
        </div>
      </div>
    </div>
  );
};

export default TermsPage;
